app/views/students/show.html.erb

SELECT "sections".* FROM "sections" WHERE "sections"."student_id" = ?  [["student_id", 1]]
---
<tbody>
  <% @student.sections.each do |section| %>