app/views/teachers/show.html.erb

SELECT "sections".* FROM "sections" WHERE "sections"."teacher_id" = ?  [["teacher_id", 2]]
---
<tbody>
  <% @teacher.sections.each do |section| %>