app/controllers/comments_controller.rb

  def create
      @course = Course.find(params[:course_id])
      @comment = @course.comments.create(comment_params)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("nombreUsuario", "comentario", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombreUsuario", "javier"], ["comentario", "hola mundo"], ["course_id", 2], ["created_at", "2019-09-25 14:36:58.348189"], ["updated_at", "2019-09-25 14:36:58.348189"]]

  def destroy
      @course = Course.find(params[:course_id])
      @comment = @course.comments.find(params[:id])
      @comment.destroy
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."course_id" = ? AND "comments"."id" = ? LIMIT ?  [["course_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]