app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
---
  def index
    @courses = Course.all

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @course = Course.find(params[:id])

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @course = Course.find(params[:id])

INSERT INTO "courses" ("nrc", "sigla", "nombreCurso", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nrc", 1234], ["sigla", "ICF233"], ["nombreCurso", "Software II"], ["created_at", "2019-10-07 00:33:30.367781"], ["updated_at", "2019-10-07 00:33:30.367781"]]
---
  def create
    #render plain: params[:course].inspect
    #@course = Course.new(params.require(:course).permit(:nrc, :sigla, :nombreCurso))
    #@course = Course.new(params[:course])
    @course = Course.new(course_params)
    if @course.save

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "courses" SET "nombreCurso" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["nombreCurso", "Ingenieria De Software III"], ["updated_at", "2019-09-26 20:32:12.003024"], ["id", 2]]
---
  def update
    @course = Course.find(params[:id])
    if @course.update(course_params)

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 15]]
---
  def destroy
    @course = Course.find(params[:id])
    @course.destroy