app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections"
---
  def index
    @sections = Section.all

INSERT INTO "sections" ("student_id", "course_id", "teacher_id", "created_at", "updated_at", "nota") VALUES (?, ?, ?, ?, ?, ?)  [["student_id", 2], ["course_id", 2], ["teacher_id", 2], ["created_at", "2019-10-06 22:18:22.230168"], ["updated_at", "2019-10-06 22:18:22.230168"], ["nota", 2]]
---
  def create
    @section = Section.new(section_params)

    respond_to do |format|
      if @section.save

UPDATE "sections" SET "nota" = ?, "updated_at" = ? WHERE "sections"."id" = ?  [["nota", 0], ["updated_at", "2019-10-06 22:19:02.790978"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @section.update(section_params)

DELETE FROM "sections" WHERE "sections"."id" = ?  [["id", 1]]
---
  def destroy
    @section.destroy

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_section
      @section = Section.find(params[:id])