app/controllers/students_controller.rb

INSERT INTO "students" ("nombre", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nombre", "gabriel liar"], ["created_at", "2019-10-07 00:34:55.625207"], ["updated_at", "2019-10-07 00:34:55.625207"]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save