app/controllers/teachers_controller.rb

SELECT "teachers".* FROM "teachers"
---
  def index
    @teachers = Teacher.all

INSERT INTO "teachers" ("nombre", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nombre", "pablo hernandez"], ["created_at", "2019-10-07 00:37:03.758279"], ["updated_at", "2019-10-07 00:37:03.758279"]]
---
  def create
    @teacher = Teacher.new(teacher_params)

    respond_to do |format|
      if @teacher.save

DELETE FROM "teachers" WHERE "teachers"."id" = ?  [["id", 1]]
---
  def destroy
    @teacher.destroy

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_teacher
      @teacher = Teacher.find(params[:id])